dictionary = {
    "Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
    "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин", "Левашев"],
    "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
    "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
    "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
    "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
    "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает", "Студент"]
}
def update_data(data):
    updated_data = {}

    for i in range(len(data["Имя"])):
        if data["Имя"][i] == "Кирилл":
            data["Имя"][i] = "Кириллл"

        if data["Фамилия"][i] == "Никитин" and data["Город проживания"][i] == "Москва":
            data["Город проживания"][i] = "Махачкала"

        if data["Фамилия"][i] == "Лихачев" and data["Имя"][i] == "Аркадий":
            continue

        full_name = data["Фамилия"][i] + " " + data["Имя"][i]
        birth_date = str(data["Год рождения"][i]) + "-" + str(data["Месяц рождения"][i]).zfill(2) + "-" + str(data["Число рождения"][i]).zfill(2)

        updated_data[full_name] = [data["Фамилия"][i] + "--" + data["Имя"][i], birth_date, data["Город проживания"][i], data["Статус"][i]]

    return updated_data

updated_data = update_data(dictionary)

for key, value in updated_data.items():
    print(key + ":", value)
